# Key Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategoryNameMapIterator..::..Key Property
CategoryNameMapIterator Class See Also
---
Retrieves the category name that is the current focus of the iterator.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual string Key { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Key As String
	Get
```

Visual C++
---
```text
public:
virtual property String^ Key {
	String^ get ();
}
```

# Remarks
A new or Reset iterator must have MoveNext called on it before Current will return a valid key as per expected behavior of IEnumerator.
# See Also
CategoryNameMapIterator Class
Autodesk.Revit.DB Namespace